class test::utf_is_bad {

$a = @(END/tL)
SSH PRIVATE KEY FILE FORMAT 1.1\n\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000\b\u0000\b\u0000À´<8a>\u0013ªq\rÝ~¾x<84>[ <91>é7Îr\u000e£T)<9c>½ò\u001e#A×jèÖÀ<8c>éö(\u0017Fñ\u0012ð³Õ?<96>P3 Ì&<88>g\u0000<92><8c>z°ú<89>\u0017§\u0003éÓ\u0005<86>¼M`H\u0005<96>\u0010<8e><89><99>¦<94>Æ<83>ìï{<94>>2<8a>f\u0011å\u0012\u0018<8e><96>v<94>ÞH'\u00150lM­Ê[îV<84>§Ã\u0002T\u0012f·Þþiú@<89>SÍ?î<80>\tûzE\u001b\u0014Å<82>oÞ¸©\u000fI\tNÒ¥ Ù<8c>|J¬'ãË\u0005'2cÒ<89>ÃÑE2TÙT¾<8f>ì\nù\u0010¨ª\u0012Ã-\u0011S<9f>\u0007<96>\\×cñ\u001e@õ<86>ýy\u000epBñÐîÇÞ´ð=Æiy`yBD)<8c>é£:Sîq{õ´vðyê<84>\f¬6\u0007ßx<8c>\u0013é`2ê<8d>ÄT\u0005<87>¡5¼hÌT,\u0003<94>\rXí\u0000\u0006#\u0000\u0000\u00
|-END

  file {'/test':
    ensure => file,
    content => $a, 
  }

}
